routes/web.php

});

Route::get('/jobs', function () {
    $jobs = Job::with('employer')->latest()->paginate(3);//using the Job class to get all the jobs, and also fetch the related employer in the same database query.//paginate shows the page numbers whereas simple paginate just shows 2 buttons next and previous,  3 here means 3 records must be there per page
---
select * from "employers" where "employers"."id" in (18, 19, 20)